# 182. Duplicate Emails

Write a SQL query to find all duplicate emails in a table named Person.

+----+---------+
| Id | Email   |
+----+---------+
| 1  | a@b.com |
| 2  | c@d.com |
| 3  | a@b.com |
+----+---------+
For example, your query should return the following for the above table:

+---------+
| Email   |
+---------+
| a@b.com |
+---------+

In [9]:
import pandas as pd
Person = pd.DataFrame({'Id':[1,2,3],'Email':['a@b.com','c@d.com','a@b.com']})
Person= Person [['Id','Email']]
Person

   Id    Email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [10]:
type(Person)

pandas.core.frame.DataFrame

In [11]:
Person.groupby('Email').filter(lambda g: len(g) > 1).groupby('Email').size()

Email
a@b.com    2
dtype: int64

In [12]:
output=Person.groupby('Email').filter(lambda g: len(g) > 1).groupby('Email').size()

In [13]:
output = output.to_frame()
output

         0
Email
a@b.com  2

In [14]:
output1=output.copy()
output1

         0
Email
a@b.com  2

In [15]:
type(output)

pandas.core.frame.DataFrame

In [16]:
output1.reset_index(inplace=True)
output1

     Email  0
0  a@b.com  2

In [17]:
output

         0
Email
a@b.com  2

In [18]:
#The reset_index method, called with the default parameters, 
#converts all index levels to columns and uses a simple RangeIndex as new index.
output.reset_index(level='Email',inplace=True)
output

     Email  0
0  a@b.com  2

In [19]:
output[['Email']]

     Email
0  a@b.com

In [20]:
print(output[['Email']].to_string(index=False))

Email
a@b.com

In [21]:
Person.groupby('Email').filter(lambda g: len(g) > 1).groupby('Email').size().sort_values(ascending=False)

Email
a@b.com    2
dtype: int64

In [22]:
newdf = Employee_177.sort_values('Salary',ascending = False)
print(newdf)
print(newdf.iloc[1])
print(newdf['Salary'][4])
print(newdf['Salary'][5])
print(newdf['Salary'][6])

NameError: name 'Employee_177' is not defined

# pandas.Series.to_frame
Series.to_frame(name=None)[source]
Convert Series to DataFrame.

# pandas.Series.tolist
Series.tolist()[source]
Return a list of the values.

# 183. Customers who never order

Suppose that a website contains two tables, the Customers table and the Orders table. 
Write a SQL query to find all customers who never order anything.

Table: Customers.

+----+-------+
| Id | Name  |
+----+-------+
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |
+----+-------+
Table: Orders.

+----+------------+
| Id | CustomerId |
+----+------------+
| 1  | 3          |
| 2  | 1          |
+----+------------+
Using the above tables as example, return the following:

+-----------+
| Customers |
+-----------+
| Henry     |
| Max       |

In [23]:
import pandas as pd
Customers = pd.DataFrame({'Id':[1,2,3,4],'Name':['Joe','Henry','Sam','Max']})
Customers= Customers[['Id','Name']]
Customers

   Id   Name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [24]:
Orders= pd.DataFrame({'Id':[1,2],'CustomerId':[3,1]})
Orders= Orders[['Id','CustomerId']]
Orders

   Id  CustomerId
0   1           3
1   2           1

In [25]:
pm=pd.merge(Customers,Orders,how='left', left_on='Id', right_on='CustomerId')
pm

   Id_x   Name  Id_y  CustomerId
0     1    Joe   2.0         1.0
1     2  Henry   NaN         NaN
2     3    Sam   1.0         3.0
3     4    Max   NaN         NaN

In [26]:
output=pm[pm['CustomerId'].isnull()][['Name']]
output

    Name
1  Henry
3    Max

In [27]:
print(output.to_string(index=False))

Name
Henry
  Max

In [28]:
import pandas as pd
Customers1 = pd.DataFrame({'Id':[1,2,3,4],'Name':['Joe','Henry','Sam','Max']})
Customers1= Customers1[['Id','Name']]
Customers1

   Id   Name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [29]:
Orders1= pd.DataFrame({'Id':[1,2],'CustomerId':[3,1]})
Orders1= Orders1[['Id','CustomerId']]
Orders1

   Id  CustomerId
0   1           3
1   2           1

In [30]:
type(Orders1.CustomerId)

pandas.core.series.Series

In [31]:
ll=Orders1.CustomerId.tolist()
ll

[3, 1]

In [32]:
Customers1[Customers1.Id.isin([1,2])]

   Id   Name
0   1    Joe
1   2  Henry

In [33]:
Customers1[~Customers1.Id.isin([1,2])]

   Id Name
2   3  Sam
3   4  Max

In [34]:
Customers1[~Customers1.Id.isin(Orders1.CustomerId.tolist())]

   Id   Name
1   2  Henry
3   4    Max

# 184. Department Highest Salary

The Employee table holds all employees. Every employee has an Id, a salary, and there is also a column for the department Id.

+----+-------+--------+--------------+
| Id | Name  | Salary | DepartmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 70000  | 1            |
| 2  | Henry | 80000  | 2            |
| 3  | Sam   | 60000  | 2            |
| 4  | Max   | 90000  | 1            |
+----+-------+--------+--------------+
The Department table holds all departments of the company.

+----+----------+
| Id | Name     |
+----+----------+
| 1  | IT       |
| 2  | Sales    |
+----+----------+
Write a SQL query to find employees who have the highest salary in each of the departments. 
For the above tables, Max has the highest salary in the IT department and Henry has the highest salary in the Sales department.

+------------+----------+--------+
| Department | Employee | Salary |
+------------+----------+--------+
| IT         | Max      | 90000  |
| Sales      | Henry    | 80000  |
+------------+----------+--------+

In [35]:
import pandas as pd
Employee1= pd.DataFrame([[1,'Joe',70000,1],[2,'Henry',80000,2],[3,'Sam',60000,2],[4,'Max',90000,1]],columns=['Id','Name','Salary','DepartmentId'])
Employee1

   Id   Name  Salary  DepartmentId
0   1    Joe   70000             1
1   2  Henry   80000             2
2   3    Sam   60000             2
3   4    Max   90000             1

In [36]:
import pandas as pd
Employee= pd.DataFrame({'Id':[1,2,3,4],'Name':['Joe','Henry','Sam','Max'],'Salary':[70000,80000,60000,90000],'DepartmentId':[1,2,2,1]})
Employee= Employee[['Id','Name','Salary','DepartmentId']]
Employee

   Id   Name  Salary  DepartmentId
0   1    Joe   70000             1
1   2  Henry   80000             2
2   3    Sam   60000             2
3   4    Max   90000             1

In [37]:
Department= pd.DataFrame({'Id':[1,2],'Name':['IT','Sales']})
Department= Department[['Id','Name']]
Department

   Id   Name
0   1     IT
1   2  Sales

In [38]:
pme=pd.merge(Department,Employee,how='left', left_on='Id', right_on='DepartmentId')
pme

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
0     1     IT     1    Joe   70000             1
1     1     IT     4    Max   90000             1
2     2  Sales     2  Henry   80000             2
3     2  Sales     3    Sam   60000             2

In [39]:
pme['Name_x']

0       IT
1       IT
2    Sales
3    Sales
Name: Name_x, dtype: object

In [40]:
pme['Salary']

0    70000
1    90000
2    80000
3    60000
Name: Salary, dtype: int64

In [41]:
pme.Salary

0    70000
1    90000
2    80000
3    60000
Name: Salary, dtype: int64

In [42]:
pme.groupby(['Name_x']).size()

Name_x
IT       2
Sales    2
dtype: int64

In [43]:
x=pme.groupby('Name_x')

x

In [44]:
pme.reset_index().groupby(['Name_x'])['Salary'].idxmax()

Name_x
IT       1
Sales    2
Name: Salary, dtype: int64

In [45]:
outp=pme.loc[pme.reset_index().groupby(['Name_x'])['Salary'].idxmax()]
outp

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
1     1     IT     4    Max   90000             1
2     2  Sales     2  Henry   80000             2

In [46]:
output=outp[['Name_x','Name_y','Salary']]
output

  Name_x Name_y  Salary
1     IT    Max   90000
2  Sales  Henry   80000

In [47]:
output.columns=['Department','Employee','Salary']
output

  Department Employee  Salary
1         IT      Max   90000
2      Sales    Henry   80000

In [48]:
print(output.to_string(index=False))

Department Employee  Salary
       IT      Max   90000
    Sales    Henry   80000

In [49]:
pme.sort_values('Salary',ascending = False)

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
1     1     IT     4    Max   90000             1
2     2  Sales     2  Henry   80000             2
0     1     IT     1    Joe   70000             1
3     2  Sales     3    Sam   60000             2

In [50]:
pme.sort_values('Salary',ascending = False).groupby('Name_x')

# 185. Department top 3 salaries

The Employee table holds all employees. Every employee has an Id, and there is also a column for the department Id.

+----+-------+--------+--------------+
| Id | Name  | Salary | DepartmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 70000  | 1            |
| 2  | Henry | 80000  | 2            |
| 3  | Sam   | 60000  | 2            |
| 4  | Max   | 90000  | 1            |
| 5  | Janet | 69000  | 1            |
| 6  | Randy | 85000  | 1            |
+----+-------+--------+--------------+
The Department table holds all departments of the company.

+----+----------+
| Id | Name     |
+----+----------+
| 1  | IT       |
| 2  | Sales    |
+----+----------+
Write a SQL query to find employees who earn the top three salaries in each of the department.
For the above tables, your SQL query should return the following rows.

+------------+----------+--------+
| Department | Employee | Salary |
+------------+----------+--------+
| IT         | Max      | 90000  |
| IT         | Randy    | 85000  |
| IT         | Joe      | 70000  |
| Sales      | Henry    | 80000  |
| Sales      | Sam      | 60000  |
+------------+----------+--------+

In [60]:
import pandas as pd
Employee= pd.DataFrame({'Id':[1,2,3,4,5,6,7],'Name':['Joe','Henry','Sam','Max','Janet','Randy','Luke'],
                        'Salary':[70000,80000,60000,90000,69000,85000,90000],'DepartmentId':[1,2,2,1,1,1,1]})
Employee= Employee[['Id','Name','Salary','DepartmentId']]
Employee

   Id   Name  Salary  DepartmentId
0   1    Joe   70000             1
1   2  Henry   80000             2
2   3    Sam   60000             2
3   4    Max   90000             1
4   5  Janet   69000             1
5   6  Randy   85000             1
6   7   Luke   90000             1

In [61]:
Department= pd.DataFrame({'Id':[1,2],'Name':['IT','Sales']})
Department= Department[['Id','Name']]
Department

   Id   Name
0   1     IT
1   2  Sales

In [62]:
pme1=pd.merge(Department,Employee,how='left', left_on='Id', right_on='DepartmentId')
pme1

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
0     1     IT     1    Joe   70000             1
1     1     IT     4    Max   90000             1
2     1     IT     5  Janet   69000             1
3     1     IT     6  Randy   85000             1
4     1     IT     7   Luke   90000             1
5     2  Sales     2  Henry   80000             2
6     2  Sales     3    Sam   60000             2

In [63]:
pme1.groupby('Name_x').head(2)

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
0     1     IT     1    Joe   70000             1
1     1     IT     4    Max   90000             1
5     2  Sales     2  Henry   80000             2
6     2  Sales     3    Sam   60000             2

In [81]:
pme1

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
0     1     IT     1    Joe   70000             1
1     1     IT     4    Max   90000             1
2     1     IT     5  Janet   69000             1
3     1     IT     6  Randy   85000             1
4     1     IT     7   Luke   90000             1
5     2  Sales     2  Henry   80000             2
6     2  Sales     3    Sam   60000             2

In [199]:
outputtt=pme1.sort_values(['Name_x','Salary',],ascending=[True,False])
print(outputtt)
#outputtt.groupby('Name_x').head(3)

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
1     1     IT     4    Max   90000             1
4     1     IT     7   Luke   90000             1
3     1     IT     6  Randy   85000             1
0     1     IT     1    Joe   70000             1
2     1     IT     5  Janet   69000             1
5     2  Sales     2  Henry   80000             2
6     2  Sales     3    Sam   60000             2

In [200]:
outputtt.groupby('Name_x').head(3)

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
1     1     IT     4    Max   90000             1
4     1     IT     7   Luke   90000             1
3     1     IT     6  Randy   85000             1
5     2  Sales     2  Henry   80000             2
6     2  Sales     3    Sam   60000             2

In [202]:
outputtt

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
1     1     IT     4    Max   90000             1
4     1     IT     7   Luke   90000             1
3     1     IT     6  Randy   85000             1
0     1     IT     1    Joe   70000             1
2     1     IT     5  Janet   69000             1
5     2  Sales     2  Henry   80000             2
6     2  Sales     3    Sam   60000             2

In [206]:
outputtt.groupby('Name_x')['Salary'].nlargest(3)

Name_x
IT      1    90000
        4    90000
        3    85000
Sales   5    80000
        6    60000
Name: Salary, dtype: int64

In [71]:
output1=pme1.groupby('Name_x')['Salary'].nlargest(3)
output1

Name_x
IT      1    90000
        4    90000
        3    85000
Sales   5    80000
        6    60000
Name: Salary, dtype: int64

In [92]:
output=pme1.groupby('Name_x')['Salary'].nlargest(3).reset_index()
output

  Name_x  level_1  Salary
0     IT        1   90000
1     IT        4   90000
2     IT        3   85000
3  Sales        5   80000
4  Sales        6   60000

In [77]:
outp=pme1.groupby('Name_x')['Salary'].nlargest(3).reset_index()
outp

  Name_x  level_1  Salary
0     IT        1   90000
1     IT        4   90000
2     IT        3   85000
3  Sales        5   80000
4  Sales        6   60000

In [90]:
outputt=pme1.groupby('Name_x')['Salary'].nlargest(3).reset_index()
outputt

  Name_x  level_1  Salary
0     IT        1   90000
1     IT        4   90000
2     IT        3   85000
3  Sales        5   80000
4  Sales        6   60000

In [130]:
outputt=pme1.groupby('Name_x')['Salary'].nlargest(3).reset_index()
outputt

  Name_x  level_1  Salary
0     IT        1   90000
1     IT        4   90000
2     IT        3   85000
3  Sales        5   80000
4  Sales        6   60000

In [86]:
type(output)

pandas.core.frame.DataFrame

In [68]:
dfN = pme1.groupby('Name_x').apply(lambda x:x['Salary'].reset_index()).reset_index()
dfN

  Name_x  level_1  index  Salary
0     IT        0      0   70000
1     IT        1      1   90000
2     IT        2      2   69000
3     IT        3      3   85000
4     IT        4      4   90000
5  Sales        0      5   80000
6  Sales        1      6   60000

In [121]:
outputt=pme1.sort_values(['Name_x','Salary','Name_y'],ascending=[True,False,True])
outputt

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
4     1     IT     7   Luke   90000             1
1     1     IT     4    Max   90000             1
3     1     IT     6  Randy   85000             1
0     1     IT     1    Joe   70000             1
2     1     IT     5  Janet   69000             1
5     2  Sales     2  Henry   80000             2
6     2  Sales     3    Sam   60000             2

In [133]:
outputt=pme1.sort_values(['Name_x','Salary','Name_y'],ascending=[True,False,True])
outputt

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
4     1     IT     7   Luke   90000             1
1     1     IT     4    Max   90000             1
3     1     IT     6  Randy   85000             1
0     1     IT     1    Joe   70000             1
2     1     IT     5  Janet   69000             1
5     2  Sales     2  Henry   80000             2
6     2  Sales     3    Sam   60000             2

In [136]:
outputt['Salary'].nlargest(2)

4    90000
1    90000
Name: Salary, dtype: int64

In [158]:
aa=outputt.groupby('Name_x').apply(lambda x:x[['Salary','Name_y']].reset_index()).reset_index()
aa

  Name_x  level_1  index  Salary Name_y
0     IT        0      4   90000   Luke
1     IT        1      1   90000    Max
2     IT        2      3   85000  Randy
3     IT        3      0   70000    Joe
4     IT        4      2   69000  Janet
5  Sales        0      5   80000  Henry
6  Sales        1      6   60000    Sam

In [184]:
aa.groupby('Name_x')['Salary'].nlargest(3).reset_index()

  Name_x  level_1  Salary
0     IT        0   90000
1     IT        1   90000
2     IT        2   85000
3  Sales        5   80000
4  Sales        6   60000

In [190]:
output185=aa.iloc[aa.groupby('Name_x')['Salary'].nlargest(3).reset_index()['level_1']]
output185

  Name_x  level_1  index  Salary Name_y
0     IT        0      4   90000   Luke
1     IT        1      1   90000    Max
2     IT        2      3   85000  Randy
5  Sales        0      5   80000  Henry
6  Sales        1      6   60000    Sam

In [189]:
aa

  Name_x  level_1  index  Salary Name_y
0     IT        0      4   90000   Luke
1     IT        1      1   90000    Max
2     IT        2      3   85000  Randy
3     IT        3      0   70000    Joe
4     IT        4      2   69000  Janet
5  Sales        0      5   80000  Henry
6  Sales        1      6   60000    Sam

In [174]:
aa.loc[aa.groupby('Name_x')['Salary'].nlargest(2).reset_index()]

ValueError: Cannot index with multidimensional key

In [187]:
aa.loc[aa.groupby('Name_x')['Salary'].nlargest(2).reset_index()['level_1']]
aa

  Name_x  level_1  index  Salary Name_y
0     IT        0      4   90000   Luke
1     IT        1      1   90000    Max
2     IT        2      3   85000  Randy
3     IT        3      0   70000    Joe
4     IT        4      2   69000  Janet
5  Sales        0      5   80000  Henry
6  Sales        1      6   60000    Sam

In [173]:
aa.nlargest(2,columns=['Salary']) #,'Salary'])

  Name_x  level_1  index  Salary Name_y
0     IT        0      4   90000   Luke
1     IT        1      1   90000    Max

In [163]:
outpp=aa.groupby('Name_x')['Salary'].nlargest(3).reset_index()
outpp

  Name_x  level_1  Salary
0     IT        0   90000
1     IT        1   90000
2     IT        2   85000
3  Sales        5   80000
4  Sales        6   60000

In [191]:
output185=output185[['Name_x','Name_y','Salary']]
output185

  Name_x Name_y  Salary
0     IT   Luke   90000
1     IT    Max   90000
2     IT  Randy   85000
5  Sales  Henry   80000
6  Sales    Sam   60000

In [192]:
output185.columns=['Department','Employee','Salary']
output185

  Department Employee  Salary
0         IT     Luke   90000
1         IT      Max   90000
2         IT    Randy   85000
5      Sales    Henry   80000
6      Sales      Sam   60000

In [195]:
print(output185.to_string(index=False))

Department Employee  Salary
       IT     Luke   90000
       IT      Max   90000
       IT    Randy   85000
    Sales    Henry   80000
    Sales      Sam   60000

# top 2 salaries in each department (using "nlargest") ----

In [15]: df.loc[df.groupby('dep')['salary'].nlargest(2).reset_index()['level_1']]

In [127]:
outputt.nlargest(1,['S'])

   Id Dname  Eid  Name      S  Did
4   1    IT    7  Luke  90000    1

KeyError: 'Dname'

In [149]:
pme1.sort_values(by=['Name_x','Name_y'],ascending=[True,True]).nlargest(2,'Salary')

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
4     1     IT     7   Luke   90000             1
1     1     IT     4    Max   90000             1

In [113]:
df = pme1.groupby('Name_x').apply(lambda x:x[['Salary','Name_y']].sort_values(ascending=[True,False])).reset_index()
df
#outputt=pme1.groupby('Name_x')['Salary'].nlargest(3).reset_index()
#outputt
#outputt=pme1.sort_values(['Name_x','Salary','Name_y'],ascending=[True,False,True])

TypeError: sort_values() missing 1 required positional argument: 'by'

In [111]:
dfN1 = pme1.groupby('Name_x').apply(lambda x:x['Salary'].sort_values()).reset_index()
dfN1

  Name_x  level_1  Salary
0     IT        2   69000
1     IT        0   70000
2     IT        3   85000
3     IT        1   90000
4     IT        4   90000
5  Sales        6   60000
6  Sales        5   80000

In [74]:
dfN2 = pme1.groupby('Name_x').apply(lambda x:x['Salary'].sort_values(ascending=False))
dfN2

Name_x
IT      4    90000
        1    90000
        3    85000
        0    70000
        2    69000
Sales   5    80000
        6    60000
Name: Salary, dtype: int64

# 196. Delete duplicate emails

Write a SQL query to delete all duplicate email entries in a table named Person,
keeping only unique emails based on its smallest Id.

+----+------------------+
| Id | Email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
| 3  | john@example.com |
+----+------------------+
Id is the primary key column for this table.
For example, after running your query, the above Person table should have the following rows:

+----+------------------+
| Id | Email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
+----+------------------+

In [207]:
import pandas as pd
Person = pd.DataFrame({'Id':[1,2,3],'Email':['john@example.com','bob@example.com','john@example.com']})
Person= Person [['Id','Email']]
Person

   Id             Email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [210]:
Person['Email'].unique().tolist()
#Customers1[~Customers1.Id.isin(Orders1.CustomerId.tolist())]

['john@example.com', 'bob@example.com']

In [214]:
Person

   Id             Email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [215]:
Person[Person['Id']==2]

   Id            Email
1   2  bob@example.com

In [222]:
Person[~Person.Id.isin([2])]
#Customers1[~Customers1.Id.isin([1,2])]

   Id             Email
0   1  john@example.com
2   3  john@example.com

In [231]:
Person.groupby('Email')['Id'].min().tolist()

[2, 1]

In [233]:
Person[Person.Id.isin(Person.groupby('Email')['Id'].min().tolist())]

   Id             Email
0   1  john@example.com
1   2   bob@example.com

In [235]:
Person=Person[Person.Id.isin(Person.groupby('Email')['Id'].min().tolist())]
Person

   Id             Email
0   1  john@example.com
1   2   bob@example.com

In [236]:
print(Person.to_string(index=False))

Id             Email
 1  john@example.com
 2   bob@example.com

# 197. Rising temperature

Given a Weather table, write a SQL query to find all dates Ids with higher temperature compared
to its previous (yesterdays) dates.

+---------+------------------+------------------+
| Id(INT) | RecordDate(DATE) | Temperature(INT) |
+---------+------------------+------------------+
|       1 |       2015-01-01 |               10 |
|       2 |       2015-01-02 |               25 |
|       3 |       2015-01-03 |               20 |
|       4 |       2015-01-04 |               30 |
+---------+------------------+------------------+
For example, return the following Ids for the above Weather table:

+----+
| Id |
+----+
|  2 |
|  4 |
+----+

In [237]:
import pandas as pd
Weathe = pd.DataFrame({'Id':[1,2,3,4],'RecordDate':['2015-01-01','2015-01-02','2015-01-03','2015-01-04'],
                       'Temperature':[10,25,20,40]})
Weathe=Weathe[['Id','RecordDate','Temperature']]
Weathe

   Id  RecordDate  Temperature
0   1  2015-01-01           10
1   2  2015-01-02           25
2   3  2015-01-03           20
3   4  2015-01-04           40

In [240]:
import pandas as pd
Weather= pd.DataFrame({'Id':[1,2,3,4],
                       'Temperature':[10,25,20,40]})
Weather['RecordDate']=pd.to_datetime(['2015-01-01','2015-01-02','2015-01-03','2015-01-04'])
Weather=Weather[['Id','RecordDate','Temperature']]
Weather

   Id RecordDate  Temperature
0   1 2015-01-01           10
1   2 2015-01-02           25
2   3 2015-01-03           20
3   4 2015-01-04           40

In [243]:
Weather['Tem1']=Weather.Temperature.shift(-1)
#df['gdp'] = df['gdp'].shift(-1)
Weather

   Id RecordDate  Temperature  Tem1
0   1 2015-01-01           10  25.0
1   2 2015-01-02           25  20.0
2   3 2015-01-03           20  40.0
3   4 2015-01-04           40   NaN

In [244]:
Weather[Weather['Tem1']>=Weather.Temperature]

   Id RecordDate  Temperature  Tem1
0   1 2015-01-01           10  25.0
2   3 2015-01-03           20  40.0

In [259]:
Weather[Weather['Tem1']>=Weather.Temperature].Tem1.astype(int)

0    25
2    40
Name: Tem1, dtype: int32

In [261]:
Weather[Weather['Tem1']>=Weather.Temperature].Tem1.astype(int).tolist()

[25, 40]

In [269]:
output197=Weather[Weather.Temperature.isin(
Weather[Weather['Tem1']>=Weather.Temperature].Tem1.astype(int).tolist()
)]
output197

   Id RecordDate  Temperature  Tem1
1   2 2015-01-02           25  20.0
3   4 2015-01-04           40   NaN

In [271]:
output197=output197[['Id']]
output197

   Id
1   2
3   4

In [272]:
print(output197.to_string(index=False))

Id
 2
 4

# 177 NthHighestSalary

In [ ]:
def getNthHighestSalary(N):
    newdf = Employee_177.sort_values('Salary',ascending = False)
    return newdf['Salary'].iloc[N-1]

print(getNthHighestSalary(3))
print(getNthHighestSalary(2))
print(getNthHighestSalary(1))

In [ ]:
def getNthHighestSalary(N):
    newdf = Employee_177.sort_values('Salary',ascending = False)
    return newdf.iloc[N-1,0]

print(getNthHighestSalary(3))
print(getNthHighestSalary(2))
print(getNthHighestSalary(1))

In [ ]:
import pandas as pd
newdf = Employee_177.sort_values('Salary',ascending = False)
print(newdf)
print(newdf.iloc[1])
print(newdf['Salary'][4])
print(newdf['Salary'][5])
print(newdf['Salary'][6])
newdf['Rank'] = newdf.Salary.rank(method='dense').astype(int)
print(newdf)
print(newdf[newdf['Rank'] == 2])
print(newdf.loc[newdf['Rank'] == 2])
subdf=(newdf.loc[newdf['Rank'] == 2])
print(subdf)
print(subdf.Age)

In [ ]:
def getNthHighestSalary(N):
    newdf = Employee_177.sort_values('Salary',ascending = False)
    newdf['Rank'] = newdf.Salary.rank(method='dense').astype(int)
    return (newdf.loc[newdf['Rank'] == N].Salary)

print(getNthHighestSalary(3))
print(getNthHighestSalary(2))
print(getNthHighestSalary(1))

In [ ]:
def getNthHighestSalary(N):
    newdf = Employee_177.sort_values('Salary',ascending = False)
    newdf['Rank'] = newdf.Salary.rank(method='dense').astype(int)
    return set(newdf.loc[newdf['Rank'] == N].Age)

print(getNthHighestSalary(3))
print(getNthHighestSalary(2))
print(getNthHighestSalary(1))

## leetcode 178

In [ ]:
Scores = pd.DataFrame({'Id':[1,2,3,4,5,6],
                       'Score':[3.50,3.65,4.00,3.85,4.00,3.65]})
#Scores.set_index('Id',inplace = True)
Scores1=Scores.style.hide_index()
Scores1

In [ ]:
Scores.sort_values('Score',ascending = False).rank(method = 'dense')

In [ ]:
Scores['Rank'] = Scores['Score'].rank(method = 'dense',ascending = False).astype(int)

In [ ]:
newdf1 = Scores.sort_values('Rank',ascending = True)


newdf1[['Score']]=newdf1[['Score']].round(2)
a= newdf1[['Score','Rank']].style.hide_index()

In [ ]:
Scores['Rank'] = Scores['Score'].rank(method = 'min',ascending = False).astype(int)
newdf2 = Scores.sort_values('Rank',ascending = True)
newdf2[['Score','Rank']].style.hide_index()

In [ ]:
Scores['Rank'] = Scores['Score'].rank(method = 'first',ascending = False).astype(int)
newdf3 = Scores.sort_values('Rank',ascending = True)

newdf3[['Score','Rank']].style.hide_index()

## leetcode 180

In [ ]:
Log = pd.DataFrame({'Id':[1,2,3,4,5,6,7],
                    'Num':[1,1,1,2,1,2,2]})
a= Log.style.hide_index()
a

In [ ]:
pd.merge(Log,a,
         how = 'outer')

## leetcode 181 Employees Earning More Than Their Managers

In [ ]:
import numpy as np
import pandas as pd
Employee_181 = pd.DataFrame({'Id':[1,2,3,4],
                             'Name':['Joe','Henry','Sam','Max'],
                             'Salay':[70000,80000,60000,90000],
                             'ManagerId':[3,4,np.nan,np.nan]})
Employee_181

In [ ]:
newdf3 =pd.merge(Employee_181,Employee_181,left_on='Id',right_on='ManagerId', how='outer')
newdf3

In [ ]:
sub2=newdf3.loc[(newdf3['Id_x']==newdf3['ManagerId_y'])]
print(sub2)
#sub2[sub2['Salay_x']<sub1['Salay_y']]

In [ ]:
sub2[sub2['Salay_x']<sub2['Salay_y']]

In [ ]:
sub2[sub2['Salay_x']<sub2['Salay_y']].Name_y

In [ ]:
set(sub2[sub2['Salay_x']<sub2['Salay_y']].Name_y)